// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает остаток по переданной номенклатуре в виде соответствия, где ключ - склад,
// а значение - количество остатка на данном складе.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, по которой необходимо получить остатки.
//
// Возвращаемое значение:
//  Соответствие из Строка - соответствие складов и количества остатков.
//
Функция ОстаткиПоСкладам(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОстатки.Склад КАК Склад,
		|	ТоварыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Склад, Выборка.Количество);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает остатки номенклатуры по указанным складам на начало заданной даты.
//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура, по которой получаются остатки
//   Склады - Массив из С - склады, по которым получаются остатки
//   Дата - Дата - дата, на начало которой получаются остатки
//
// Возвращаемое значение:
//   Соответствие из Строка в Число - остатки номенклатуры, где ключ - склад, значение - количество остатка

Функция ОстатокПоСкладам(Номенклатура, Склады, Дата) Экспорт

	ДатаОстатков = НачалоДня(Дата);

	СоответствиеОстатков = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыОстатки.Склад КАК Склад,
		|	ТоварыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Товары.Остатки(&Дата, Номенклатура = &Номенклатура И Склад В (&Склады)) КАК ТоварыОстатки";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Дата", ДатаОстатков);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеОстатков.Вставить(Выборка.Склад, Выборка.Количество);
	КонецЦикла;

	Возврат СоответствиеОстатков;

КонецФункции


#КонецОбласти
	
#КонецЕсли