
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = НСтр("ru = 'Изменилось количество'; en = 'Quantity has changed'; zh = '数量已更改'");

	ПересчитатьСумму(ТекстСообщения, ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Изменилась цена";

	ПересчитатьСумму(ТекстСообщения, ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитать сумму.
// 
// Параметры:
//  СтрокаТовары - Строка - Строка товары
//  ТекстСообщения - ДанныеФормыЭлементКоллекции - Текст сообщения
&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТовары, ТекстСообщения)

	СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

	Пользователь = ОписаниеПользователя();

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Пользователь.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатный - Булево - 
// * Стаж - Число - 
&НаКлиенте
Функция ОписаниеПользователя()

	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	Человек.Вставить("Стаж", 10);

	Возврат Человек;

КонецФункции

#КонецОбласти

